public class StorozhukLesson1 {
    public static void main(String[] args) {
        /* tasks 1-3
        1. Создать пустой проект в IntelliJ IDEA и прописать метод main().
        2. Создать переменные всех пройденных типов данных и инициализировать их значения.
        3. Написать метод, вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
           где a, b, c, d – аргументы этого метода, имеющие тип float.
        */

        System.out.println("Hello world!");
    }
}
